In [38]:
import pandas as pd
import numpy as np

In [39]:
sözlükVerisi ={"istanbul" : [30,29,np.nan],"ankara":[20,np.nan,25],"izmir":[40,39,38]}
havaDurumuDataFrame=pd.DataFrame(sözlükVerisi)

In [40]:
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [41]:
havaDurumuDataFrame.dropna()

   istanbul  ankara  izmir
0      30.0    20.0     40

In [42]:
havaDurumuDataFrame

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [43]:
havaDurumuDataFrame.dropna(axis=1)

   izmir
0     40
1     39
2     38

In [44]:
yeniVeri ={"istanbul" : [30,29,np.nan],"ankara":[20,np.nan,25],"izmir":[40,39,38],"antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)

In [45]:
yeniDataFrame

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [46]:
yeniDataFrame.dropna(axis=1,thresh=2)

   istanbul  ankara  izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [47]:
yeniDataFrame

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [48]:
yeniDataFrame.fillna(20)

   istanbul  ankara  izmir  antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

### groupby

In [49]:
maasSozlugu={"departman":["yazılım","yazılım","pazarlama","pazarlama","hukuk","hukuk"],
             "calisan ismi":["ahmet","mehmet","atıl","burak","zeynep","fatma"],
             "maas":[100,150,200,300,400,500]}

In [50]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [51]:
maasDataFrame

   departman calisan ismi  maas
0    yazılım        ahmet   100
1    yazılım       mehmet   150
2  pazarlama         atıl   200
3  pazarlama        burak   300
4      hukuk       zeynep   400
5      hukuk        fatma   500

In [52]:
grupObjesi=maasDataFrame.groupby("departman")

In [53]:
grupObjesi.count()

           calisan ismi  maas
departman
hukuk                 2     2
pazarlama             2     2
yazılım               2     2

In [56]:
grupObjesi.max()

          calisan ismi  maas
departman
hukuk           zeynep   500
pazarlama        burak   300
yazılım         mehmet   150

In [57]:
grupObjesi.describe()

           maas
          count   mean        std    min    25%    50%    75%    max
departman
hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0